In [98]:
import sqlite3

In [99]:
an_connection= sqlite3.connect('aswati.db')
print("first connection")

first connection

In [100]:
an_connection= sqlite3.connect('aswati.db')
print("first connection") 
an_connection.execute('''CREATE TABLE AN_COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         FLOAT);''')

print ("!!!!!!...........Table created..............!!!!!!!")

an_connection.close()

first connection
!!!!!!...........Table created..............!!!!!!!

In [101]:
an_connection= sqlite3.connect('aswati.db')
print ("Opened database successfully")

## \  IS A ESCAPE SEQUENCE TO BREAK THE LINE SO THAT EVERY SUBSEQUENT RECORDS GOES TO THE NEXT LINE

an_connection.execute("INSERT INTO AN_COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'ANAND JHA', 31, 'BENGALURU', 50000.00 )")

an_connection.execute("INSERT INTO AN_COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'ROY', 26, 'GURGOAN', 18000.00 )")

an_connection.execute("INSERT INTO AN_COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Ted', 22, 'NOIDA', 22000.00 )")


an_connection.commit()
print ("Records updated successfully");
an_connection.close()

Opened database successfully
Records updated successfully

In [103]:
an_connection= sqlite3.connect('aswati.db')

cur= an_connection.cursor()
cur.execute('''select * from AN_COMPANY''')
print(cur.fetchall())
an_connection.close()

[(1, 'ANAND JHA', 31, 'BENGALURU', 50000.0), (2, 'ROY', 26, 'GURGOAN', 18000.0), (3, 'Ted', 22, 'NOIDA', 22000.0)]

In [104]:
an_connection= sqlite3.connect('aswati.db')
cur= an_connection.cursor()
cur.execute('''select ID, NAME,  address, salary from AN_COMPANY''')
for ROW in  cur:
    print("ID= ", ROW[0])
    print("name=", ROW[1],)
    print ("ADDRESS = ", ROW[2])
    print ("SALARY = ", ROW[3], "\n")


an_connection.close()

ID=  1
name= ANAND JHA
ADDRESS =  BENGALURU
SALARY =  50000.0

ID=  2
name= ROY
ADDRESS =  GURGOAN
SALARY =  18000.0

ID=  3
name= Ted
ADDRESS =  NOIDA
SALARY =  22000.0

In [105]:
an_connection = sqlite3.connect('aswati.db')
print ("Opened database successfully");

an_connection.execute("UPDATE AN_COMPANY set SALARY = 25000.00 where ID = 1")## Updation
an_connection.execute("DELETE from AN_COMPANY where ID = 2;")# Delete
an_connection.commit

Opened database successfully

In [106]:
an_connection= sqlite3.connect('aswati.db')
cur= an_connection.cursor()
cur.execute('''select ID, NAME,  address, salary from AN_COMPANY''')
for ROW in  cur:
    print("ID= ", ROW[0])
    print("name=", ROW[1])
    print("ADDRESS = ", ROW[2])
    print("SALARY = ", ROW[3], "\n")


an_connection.close()

ID=  1
name= ANAND JHA
ADDRESS =  BENGALURU
SALARY =  50000.0

ID=  2
name= ROY
ADDRESS =  GURGOAN
SALARY =  18000.0

ID=  3
name= Ted
ADDRESS =  NOIDA
SALARY =  22000.0

In [107]:
import pymongo
from pymongo import mongoclient

ModuleNotFoundError: No module named 'pymongo'